Revit 2027 API
BendingDetailCustomFieldProperties.BendDiameterDimensionType Property
 Identifies what type of bend diameter dimensions will be shown (radial or diameter).
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public BendingDetailBendDiameterDimensionType BendDiameterDimensionType { get; set; }
Public Property BendDiameterDimensionType As BendingDetailBendDiameterDimensionType
	Get
	Set
public:
property BendingDetailBendDiameterDimensionType BendDiameterDimensionType {
	BendingDetailBendDiameterDimensionType get ();
	void set (BendingDetailBendDiameterDimensionType value);
}
member BendDiameterDimensionType : BendingDetailBendDiameterDimensionType with get, set
Property Value
BendingDetailBendDiameterDimensionType
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
BendingDetailCustomFieldProperties Class
Autodesk.Revit.DB.Structure Namespace